import { Component, OnInit } from '@angular/core';
import { Story } from './stories.model';

@Component({
  selector: 'app-stories',
  templateUrl: './stories.component.html',
  styleUrls: ['./stories.component.css']
})
export class StoriesComponent implements OnInit {

allstories: Array<Story>;
  constructor() { }

  ngOnInit() {
    this.allstories = [new Story('test', 'Sofia', 'Lorem Ipsum е елементарен примерен текст, използван в печатарската и типографската индустрия.'+
                                                  'Lorem Ipsum е индустриален стандарт от около 1500 година, когато неизвестен печатар взема няколко печатарски '+
                                                  'букви и ги разбърква, за да напечата с тях книга с примерни шрифтове. Този начин не само е оцелял повече от 5 века, '+
                                                  'но е навлязъл и в публикуването на електронни издания като е запазен почти без промяна. Популяризиран е през 60те години '+
                                                  'на 20ти век със издаването на Letraset листи, съдържащи Lorem Ipsum пасажи, популярен е и в наши дни във софтуер за печатни '+
                                                  'издания като Aldus PageMaker, който включва различни версии на Lorem Ipsum.'),
                        new Story('test2', 'Ruse', 'Lorem Ipsum е елементарен примерен текст, използван в печатарската и типографската индустрия.'+
                                                  'Lorem Ipsum е индустриален стандарт от около 1500 година, когато неизвестен печатар взема няколко печатарски '+
                                                  'букви и ги разбърква, за да напечата с тях книга с примерни шрифтове. Този начин не само е оцелял повече от 5 века, '+
                                                  'но е навлязъл и в публикуването на електронни издания като е запазен почти без промяна. Популяризиран е през 60те години '+
                                                  'на 20ти век със издаването на Letraset листи, съдържащи Lorem Ipsum пасажи, популярен е и в наши дни във софтуер за печатни '+
                                                  'издания като Aldus PageMaker, който включва различни версии на Lorem Ipsum.'),
                        new Story('test2', 'Varna', 'Lorem Ipsum е елементарен примерен текст, използван в печатарската и типографската индустрия.'+
                                                  'Lorem Ipsum е индустриален стандарт от около 1500 година, когато неизвестен печатар взема няколко печатарски '+
                                                  'букви и ги разбърква, за да напечата с тях книга с примерни шрифтове. Този начин не само е оцелял повече от 5 века, '+
                                                  'но е навлязъл и в публикуването на електронни издания като е запазен почти без промяна. Популяризиран е през 60те години '+
                                                  'на 20ти век със издаването на Letraset листи, съдържащи Lorem Ipsum пасажи, популярен е и в наши дни във софтуер за печатни '+
                                                  'издания като Aldus PageMaker, който включва различни версии на Lorem Ipsum.') ];
  }

}
